tests/test_data/taxes_rus.json

{
   "Дивиденды":[
      {
         "report_template": "dividend",
         "payment_date":1580156400,
         "symbol":"GE",
         "full_name":"General Electric Company",
         "isin":"US3696043013",
         "amount":1.0,
         "tax":0.1,
         "rate":61.8031,
         "country":"United States",
         "country_iso":"840",
         "tax_treaty":1,
         "amount_rub":61.8,
         "tax_rub":6.18,
         "tax2pay":1.8499999999999996
      },
      {
         "report_template": "dividend",
         "payment_date":1581106800,
         "symbol":"TLT",
         "full_name":"iShares 20+ Year Treasury Bond ETF",
         "isin":"US4642874329",
         "amount":16.94,
         "tax":0.0,
         "rate":62.7977,
         "country":"United States",
         "country_iso":"840",
         "tax_treaty":1,
         "amount_rub":1063.79,
         "tax_rub":0.0,
         "tax2pay":138.29
      },
      {
         "report_template": "dividend",
         "payment_date":1587586800,
         "symbol":"ERIC",
         "full_name":"Telefonaktiebolaget LM Ericsson B ADR",
         "isin":"US2948216088",
         "amount":3.74,
         "tax":1.12,
         "rate":76.2562,
         "country":"Sweden",
         "country_iso":"752",
         "tax_treaty":1,
         "amount_rub":285.2,
         "tax_rub":85.41,
         "tax2pay":0
      },
      {
         "report_template": "totals",
         "amount": 21.68,
         "amount_rub": 1410.79,
         "tax": 1.2200000000000002,
         "tax_rub": 91.59,
         "tax2pay": 140.14
      }
   ],
   "Акции":[
      {
         "report_template": "trade",
         "symbol":"GOLD",
         "isin":"CA0679011084",
         "qty":10.0,
         "country_iso":"840",
         "o_date":1569334259,
         "o_rate":63.9453,
         "os_date":1569456000,
         "o_number":"0001",
         "os_rate":64.1873,
         "o_price":18.74,
         "o_qty":10.0,
         "o_fee":0.32825725,
         "c_date":1582116724,
         "c_rate":63.7698,
         "cs_date":1582243200,
         "c_number":"0002",
         "cs_rate":63.7413,
         "c_price":20.95,
         "c_qty":-10.0,
         "c_fee":0.3370772,
         "s_dividend":0,
         "o_type":"Покупка",
         "c_type":"Продажа",
         "o_amount":187.4,
         "o_amount_rub":12028.7,
         "c_amount":209.5,
         "c_amount_rub":13353.8,
         "o_fee_rub":20.99,
         "c_fee_rub":21.5,
         "income_rub":13353.8,
         "income":209.5,
         "spending_rub":12071.19,
         "spending":188.06533445000002,
         "profit_rub":1282.6099999999988,
         "profit":21.434665549999977,
         "s_dividend_note":""
      },
      {
         "report_template": "trade",
         "c_amount": 52.92,
         "c_amount_rub": 3373.19,
         "c_date": 1582117021,
         "c_fee": 0.265096864,
         "c_fee_rub": 16.91,
         "c_number": "0000000005",
         "c_price": 13.23,
         "c_qty": -5.0,
         "c_rate": 63.7698,
         "c_type": "Продажа",
         "country_iso": "840",
         "cs_date": 1582243200,
         "cs_rate": 63.7413,
         "income": 52.92,
         "income_rub": 3373.19,
         "isin": "US8816242098",
         "o_amount": 74.08,
         "o_amount_rub": 4868.14,
         "o_date": 1549881381,
         "o_fee": 0.34625725,
         "o_fee_rub": 22.87,
         "o_number": "0000000003",
         "o_price": 18.52,
         "o_qty": 4.0,
         "o_rate": 66.0628,
         "o_type": "Покупка",
         "os_date": 1550016000,
         "os_rate": 65.7147,
         "profit": -21.77135411399999,
         "profit_rub": -1534.73,
         "qty": 4.0,
         "s_dividend": 0,
         "s_dividend_note": "",
         "spending": 74.69135411399999,
         "spending_rub": 4907.92,
         "symbol": "TEVA"
      },
      {
         "report_template": "trade",
         "c_amount": 13.23,
         "c_amount_rub": 843.3,
         "c_date": 1582117021,
         "c_fee": 0.066274216,
         "c_fee_rub": 4.23,
         "c_number": "0000000005",
         "c_price": 13.23,
         "c_qty": -5.0,
         "c_rate": 63.7698,
         "c_type": "Продажа",
         "country_iso": "840",
         "cs_date": 1582243200,
         "cs_rate": 63.7413,
         "income": 13.23,
         "income_rub": 843.3,
         "isin": "US8816242098",
         "o_amount": 15.8,
         "o_amount_rub": 1033.6,
         "o_date": 1553861071,
         "o_fee": 0.34995725,
         "o_fee_rub": 22.68,
         "o_number": "0000000004",
         "o_price": 15.8,
         "o_qty": 1.0,
         "o_rate": 64.8012,
         "o_type": "Покупка",
         "os_date": 1554163200,
         "os_rate": 65.4176,
         "profit": -2.9862314659999996,
         "profit_rub": -217.21000000000004,
         "qty": 1.0,
         "s_dividend": 0,
         "s_dividend_note": "",
         "spending": 16.216231466,
         "spending_rub": 1060.51,
         "symbol": "TEVA"
      },
      {
         "report_template": "totals",
         "income_rub": 17570.289999999997,
         "spending_rub": 18039.62,
         "profit": -3.322920030000013,
         "profit_rub": -469.3300000000013
      }
   ],
   "Облигации":[
      {
         "c_amount": 1600.0,
         "c_amount_rub": 122009.92,
         "c_date": 1604319194,
         "c_fee": 2.0,
         "c_fee_rub": 152.51,
         "c_int": 16.89,
         "c_int_rub": 1287.97,
         "c_number": "2881234589",
         "c_price": 80.0,
         "c_qty": -2.0,
         "c_rate": 76.2562,
         "c_type": "Продажа",
         "country_iso": "840",
         "cs_date": 1604448000,
         "cs_rate": 76.2562,
         "income": 1600.0,
         "income_rub": 123297.89,
         "isin": "US912909AN84",
         "o_amount": 1278.14,
         "o_amount_rub": 97466.1,
         "o_date": 1590587855,
         "o_fee": 2.0,
         "o_fee_rub": 152.51,
         "o_int": 25.69,
         "o_int_rub": 1959.02,
         "o_number": "2881234567",
         "o_price": 63.90700000000001,
         "o_qty": 2.0,
         "o_rate": 76.2562,
         "o_type": "Покупка",
         "os_date": 1590710400,
         "os_rate": 76.2562,
         "principal": 1000,
         "profit": 317.8599999999999,
         "profit_rub": 23567.75,
         "qty": 2.0,
         "spending": 1282.14,
         "spending_rub": 99730.14,
         "symbol": "X 6 1/4 03/15/26"
      },
      {
         "country_iso": "840",
         "empty": "",
         "income_rub": 4766.01,
         "interest": 62.5,
         "interest_rub": 4766.01,
         "isin": "US912909AN84",
         "number": "",
         "o_date": 1600128000,
         "rate": 76.2562,
         "symbol": "X 6 1/4 03/15/26",
         "type": "Выплата купона"
      }
   ],
   "ПФИ":[
      {
         "report_template": "trade",
         "c_amount": 131.0,
         "c_amount_rub": 8775.81,
         "c_date": 1582886521,
         "c_fee": 1.0938,
         "c_fee_rub": 71.76,
         "c_number": "2716375310",
         "c_price": 1.31,
         "c_qty": 100.0,
         "c_rate": 65.6097,
         "c_type": "Покупка",
         "country_iso": "840",
         "cs_date": 1583107200,
         "cs_rate": 66.9909,
         "income": 294.0,
         "income_rub": 18061.24,
         "o_amount": 294.0,
         "o_amount_rub": 18061.24,
         "o_date": 1579097059,
         "o_fee": 0.8018858,
         "o_fee_rub": 49.25,
         "o_number": "2661844383",
         "o_price": 2.94,
         "o_qty": -100.0,
         "o_rate": 61.414,
         "o_type": "Продажа",
         "os_date": 1579132800,
         "os_rate": 61.4328,
         "profit": 161.1043142,
         "profit_rub": 9164.420000000002,
         "qty": -100.0,
         "spending": 132.8956858,
         "spending_rub": 8896.82,
         "symbol": "AAL   210115C00030000"
      },
      {
         "report_template": "totals",
         "income_rub": 18061.24,
         "spending_rub": 8896.82,
         "profit": 161.1043142,
         "profit_rub": 9164.420000000002
      }
   ],
   "Корп.события":[
      
   ],
   "Комиссии":[
      {
         "payment_date":1605039600,
         "amount":1.0,
         "note":"ERIC(294821608) ADR Fee USD 0.02 PER SHARE - FEE",
         "rate":76.9515,
         "amount_rub":76.95
      }
   ],
   "Проценты":[
      
   ]
}